let carrData = [
    {
        name: 'Готичний',
        years: '1140-х роках',
        architects: 'Абат Сюжер, Хуан де Колонія',
        country: 'Німеччина, Чехія, Італія',
        image: 'hotic.jpg',
        about: 'Готичний стиль — це архітектурний, художній і культурний стиль, який виник у Франції в середині XII століття та поширився Європою протягом Середньовіччя, до приблизно XVI століття. Його найвиразніше прояви — в архітектурі церков, соборів і монастирів, хоча він також проявився в скульптурі, живописі, декоративному мистецтві та літературі.',
    }, {
        name: 'Японський',
        years: '1603–1868',
        architects: 'Кендзо Танґе',
        country: 'Китай, Південна Корея, Японія',
        image: 'japaN.jpg',
        about: 'Японський стиль — це загальна назва для естетичних, архітектурних і художніх традицій Японії, які сформувалися протягом століть під впливом релігії (синтоїзму, буддизму, дзен), природи, сезонності та культури стриманості. Він охоплює багато аспектів: архітектуру, живопис, дизайн, одяг, садівництво, чайну церемонію, каліграфію, літературу тощо.',
    }, {
        name: 'Довньо грецький',
        years: 'з 900 р. до н.е. до 323 рр. до н.е.',
        architects: ' Іктін, Каллікрат, Фідій',
        country: ' Греція, Єгипет, Італія',
        image: 'greek.jpg',
        about: 'Давньогрецький стиль — це основа європейського мистецтва, архітектури, філософії та естетики. Він сформувався у VIII–I ст. до н.е. в античній Греції й охоплює різні сфери культури: архітектуру, скульптуру, живопис, літературу, театр. Його вплив залишається відчутним і в сучасному мистецтві.',
    }, {
        name: 'Романський',
        years: 'Бл. 950 – 1150 роки н.е.',
        architects: 'Вільгельм Волкшперт, Гуґон з Семюра',
        country: 'Іспанія, Україна, Чехія',
        image: 'roman.jpg',
        about: 'Романський стиль — це художній і архітектурний стиль, що панував у Європі з приблизно X до середини XII століття, передуючи готиці. Він сформувався на основі римської та візантійської спадщини, а також варварських традицій, звідки й назва — «романський» (тобто "подібний до римського").',
    },
    {
        name: 'Бароко',
        years: 'Бл. 1580–1600 роки',
        architects: 'Джан Лоренцо, Карло Мадерна',
        country: 'Німеччина, Австрія, Італія',
        image: 'baroko.jpg',
        about: 'Бароко — це художній стиль, що виник в Італії наприкінці XVI століття та панував у Європі до середини XVIII століття. Його характерною рисою є пишність, емоційність, драматизм і декоративність. Бароко прагнуло вразити, викликати захоплення, підкреслити велич і розкіш — часто на службі церкви, королівської влади або знаті.',
    },
    {
        name: 'Рококо',
        years: 'Бл. 1720–1730 роки',
        architects: 'Бальтазар Нейман, Йоганн Гільдебрандт',
        country: 'Австрія, Франція, Італія',
        image: 'rokoko.jpg',
        about: 'Рококо — це мистецький стиль, який виник у Франції на початку XVIII століття, після періоду бароко. Його часто називають «бароко в мініатюрі», бо рококо успадкував декоративність і пишність бароко, але замінив драматизм і монументальність на елегантність, витонченість, грайливість і інтимність.',
    },
]

let carrApp = {
    data() {
        return {
            cars: carrData,
            currentCar: carrData[0],
            currentIndex: 0,
        }
    },
    methods: {
        showCar(index) {
            this.currentCar = carrData[index];
            this.currentIndex = index;
        }
    },
}
Vue.createApp(carrApp).mount('#vue-cont')